ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_ir.c
    /* Calculate tx SWM pulse width data as multiples of pulse width unit */
    for (i = 0; i < count; i++) {
        pwVal = 0;

        if (i < count - 1) {
            /* Put every four pulse width together as a 32-bit value to tx fifo */
            for (j = 0; j < 4; j++) {
                /* Every pulse width divided by pulse width unit */
                tmpVal = (DIVIDE_ROUND(data[j + i * 4], minData) - 1) & 0xff;
                /* Tx fifo 32-bit value: pwVal[7:0]:first pulse width, pwVal[15:8]:second pulse width... */
                pwVal |= tmpVal << (8 * j);
            }
        } else {
            /* Deal with pulse width data remained which is less than 4 */
            for (j = 0; j < length % 4; j++) {
                tmpVal = (DIVIDE_ROUND(data[j + i * 4], minData) - 1) & 0xff;
                pwVal |= tmpVal << (8 * j);
            }
        }

        /* Write to tx fifo */
        IR_SendData(&pwVal, 1);
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  IR send command function
 *
 * @param  data: data to send
 * @param  length: Length of send buffer
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type IR_SendCommand(uint32_t *data, uint8_t length)
{
    uint32_t timeoutCnt = IR_TX_INT_TIMEOUT_COUNT;

    /* Write data */
    IR_SendData(data, length);

    /* Mask tx interrupt */
    IR_IntMask(IR_INT_TX_END, MASK);

    /* Clear tx interrupt */
    IR_ClrIntStatus(IR_INT_TX_END);

    /* Enable ir tx */
    IR_Enable(IR_TX);

    /* Wait for tx interrupt */
    while (SET != IR_GetIntStatus(IR_INT_TX_END)) {
        timeoutCnt--;

        if (timeoutCnt == 0) {
            IR_Disable(IR_TX);

            return TIMEOUT;
        }
    }

    /* Disable ir tx */
    IR_Disable(IR_TX);

    /* Clear tx interrupt */
    IR_ClrIntStatus(IR_INT_TX_END);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  IR send command in software mode function
 *
 * @param  data: IR fifo data to send
 * @param  length: Length of data
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type IR_SWMSendCommand(uint16_t *data, uint8_t length)
{
    uint32_t timeoutCnt = IR_TX_INT_TIMEOUT_COUNT;

    /* Mask tx interrupt */
    IR_IntMask(IR_INT_TX_END, MASK);

    /* Clear tx interrupt */
    IR_ClrIntStatus(IR_INT_TX_END);

    /* Enable ir tx */
    IR_Enable(IR_TX);

    /* Write fifo */
    IR_SWMSendData(data, length);

    /* Wait for tx interrupt */
    while (SET != IR_GetIntStatus(IR_INT_TX_END)) {
        timeoutCnt--;

        if (timeoutCnt == 0) {
            IR_Disable(IR_TX);

            return TIMEOUT;
        }
    }

    /* Disable ir tx */
    IR_Disable(IR_TX);

    /* Clear tx interrupt */
    IR_ClrIntStatus(IR_INT_TX_END);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  IR send in NEC protocol
 *
 * @param  address: Address
 * @param  command: Command
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type IR_SendNEC(uint8_t address, uint8_t command)
{
    uint32_t tmpVal = ((~command & 0xff) << 24) + (command << 16) + ((~address & 0xff) << 8) + address;

    IR_SendCommand(&tmpVal, 1);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  IR interrupt mask or unmask function
 *
 * @param  intType: IR interrupt type
 * @param  intMask: Mask or unmask
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type IR_IntMask(IR_INT_Type intType, BL_Mask_Type intMask)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_IR_INT_TYPE(intType));

    if (intType < 3) {
        /* Mask or unmask tx interrupt */
        tmpVal = BL_RD_REG(IR_BASE, IRTX_INT_STS);

        if (MASK == intMask) {
            tmpVal |= 1 << (intType + 8);
        } else {
            tmpVal &= ~(1 << (intType + 8));
        }

        BL_WR_REG(IR_BASE, IRTX_INT_STS, tmpVal);
    } else if (intType < 6) {
        /* Mask or unmask rx interrupt */
        tmpVal = BL_RD_REG(IR_BASE, IRRX_INT_STS);

        if (MASK == intMask) {
            tmpVal |= 1 << (intType + 5);
        } else {
            tmpVal &= ~(1 << (intType + 5));
        }

        BL_WR_REG(IR_BASE, IRRX_INT_STS, tmpVal);
    } else {
        if (MASK == intMask) {
            tmpVal = BL_RD_REG(IR_BASE, IRTX_INT_STS);
            tmpVal |= 0x700;
            tmpVal = BL_RD_REG(IR_BASE, IRTX_INT_STS);
            tmpVal = BL_RD_REG(IR_BASE, IRRX_INT_STS);
            tmpVal |= 0x700;
            tmpVal = BL_RD_REG(IR_BASE, IRRX_INT_STS);
        } else {
            tmpVal = BL_RD_REG(IR_BASE, IRTX_INT_STS);
            tmpVal &= ~0x700;
            tmpVal = BL_RD_REG(IR_BASE, IRTX_INT_STS);
            tmpVal = BL_RD_REG(IR_BASE, IRRX_INT_STS);
            tmpVal &= ~0x700;
            tmpVal = BL_RD_REG(IR_BASE, IRRX_INT_STS);
        }
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Clear ir interrupt function
 *
 * @param  intType: IR interrupt type
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type IR_ClrIntStatus(IR_INT_Type intType)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_IR_INT_TYPE(intType));

    if (intType == IR_INT_TX_END || intType == IR_INT_ALL) {
        /* Clear tx interrupt */
        tmpVal = BL_RD_REG(IR_BASE, IRTX_INT_STS);
        BL_WR_REG(IR_BASE, IRTX_INT_STS, BL_SET_REG_BIT(tmpVal, IR_CR_IRTX_END_CLR));
    }

    if (intType == IR_INT_RX_END || intType == IR_INT_ALL) {
        /* Clear rx interrupt */
        tmpVal = BL_RD_REG(IR_BASE, IRRX_INT_STS);
        BL_WR_REG(IR_BASE, IRRX_INT_STS, BL_SET_REG_BIT(tmpVal, IR_CR_IRRX_END_CLR));
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  IR install interrupt callback function
 *
 * @param  intType: IR interrupt type
 * @param  cbFun: Pointer to interrupt callback function. The type should be void (*fn)(void)
 *
 * @return SUCCESS
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
BL_Err_Type IR_Int_Callback_Install(IR_INT_Type intType, intCallback_Type *cbFun)
{
    /* Check the parameters */
    CHECK_PARAM(IS_IR_INT_TYPE(intType));

    irIntCbfArra[intType] = cbFun;

    return SUCCESS;
}
#endif

/****************************************************************************/ /**
 * @brief  IR get interrupt status function
 *
 * @param  intType: IR int type
 *
 * @return IR tx or rx interrupt status
 *
*******************************************************************************/
BL_Sts_Type IR_GetIntStatus(IR_INT_Type intType)
{
    uint32_t tmpVal = 0;

    /* Check the parameters */
    CHECK_PARAM(IS_IR_INT_TYPE(intType));

    /* Read tx or rx interrupt status */
    if (intType < 3) {
        tmpVal = BL_RD_REG(IR_BASE, IRTX_INT_STS);
        tmpVal &= 1 << intType;
    } else if (intType < 6) {
        tmpVal = BL_RD_REG(IR_BASE, IRRX_INT_STS);
        tmpVal &= 1 << (intType - 3);
    } else {
    }

    if (tmpVal) {
        return SET;
    } else {
        return RESET;
    }
}

/****************************************************************************/ /**
 * @brief  IR get tx/rx fifo underflow or overflow status function
 *
 * @param  fifoSts: IR fifo status type
 *
 * @return IR fifo status
 *
*******************************************************************************/
BL_Sts_Type IR_GetFifoStatus(IR_FifoStatus_Type fifoSts)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_IR_FIFOSTATUS_TYPE(fifoSts));

    /* Read rx fifo status */
    tmpVal = BL_RD_REG(IR_BASE, IRTX_FIFO_CONFIG_0);

