ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/soc_std/bsp/std_drv/src/bl606p_ir.c
    if ((tmpVal & (1U << (fifoSts + IR_TX_FIFO_OVERFLOW_POS))) != 0) {
        return SET;
    } else {
        return RESET;
    }
}

/****************************************************************************/ /**
 * @brief  IR receive data function
 *
 * @param  irWord: IR rx data word 0 or 1
 *
 * @return Data received
 *
*******************************************************************************/
uint32_t IR_ReceiveData(IR_Word_Type irWord)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_IR_WORD_TYPE(irWord));

    /* Read word 0 or word 1 */
    if (IR_WORD_0 == irWord) {
        tmpVal = BL_RD_REG(IR_BASE, IRRX_DATA_WORD0);
    } else {
        tmpVal = BL_RD_REG(IR_BASE, IRRX_DATA_WORD1);
    }

    return tmpVal;
}

/****************************************************************************/ /**
 * @brief  IR software mode receive pulse width data function
 *
 * @param  data: Data received
 * @param  length: Max length of receive buffer
 *
 * @return Length of datas received
 *
*******************************************************************************/
uint8_t IR_SWMReceiveData(uint16_t *data, uint8_t length)
{
    uint8_t rxLen = 0;

    while (rxLen < length && IR_GetRxFifoCount() > 0) {
        /* Read data */
        data[rxLen++] = BL_RD_REG(IR_BASE, IR_FIFO_RDATA) & 0xffff;
    }

    return rxLen;
}

/****************************************************************************/ /**
 * @brief  IR receive in NEC protocol
 *
 * @param  address: Address
 * @param  command: Command
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type IR_ReceiveNEC(uint8_t *address, uint8_t *command)
{
    uint32_t tmpVal = IR_ReceiveData(IR_WORD_0);

    *address = tmpVal & 0xff;
    *command = (tmpVal >> 16) & 0xff;

    if ((~(*address) & 0xff) != ((tmpVal >> 8) & 0xff) || (~(*command) & 0xff) != ((tmpVal >> 24) & 0xff)) {
        return ERROR;
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  IR get rx data bit count function
 *
 * @param  None
 *
 * @return IR rx data bit count
 *
*******************************************************************************/
uint8_t IR_GetRxDataBitCount(void)
{
    uint32_t tmpVal;

    /* Read rx data bit count */
    tmpVal = BL_RD_REG(IR_BASE, IRRX_DATA_COUNT);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, IR_STS_IRRX_DATA_CNT);

    return tmpVal;
}

/****************************************************************************/ /**
 * @brief  IR get rx fifo count function
 *
 * @param  None
 *
 * @return IR rx fifo available count
 *
*******************************************************************************/
uint8_t IR_GetRxFifoCount(void)
{
    uint32_t tmpVal;

    /* Read rx fifo count */
    tmpVal = BL_RD_REG(IR_BASE, IRTX_FIFO_CONFIG_1);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, IR_RX_FIFO_CNT);

    return tmpVal;
}

/****************************************************************************/ /**
 * @brief  IR get tx fifo count function
 *
 * @param  None
 *
 * @return IR tx fifo available count
 *
*******************************************************************************/
uint8_t IR_GetTxFifoCount(void)
{
    uint32_t tmpVal;

    /* Read tx fifo count */
    tmpVal = BL_RD_REG(IR_BASE, IRTX_FIFO_CONFIG_1);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, IR_TX_FIFO_CNT);

    return tmpVal;
}

/****************************************************************************/ /**
 * @brief  IR learning to set rx and tx mode function
 *
 * @param  data: Buffer to save data
 * @param  length: Length of data
 *
 * @return Protocol type
 *
*******************************************************************************/
IR_RxMode_Type IR_LearnToInit(uint32_t *data, uint8_t *length)
{
    uint32_t tmpVal;
    uint32_t timeoutCnt = IR_RX_INT_TIMEOUT_COUNT;

    /* Disable clock gate */
    GLB_PER_Clock_UnGate(GLB_AHB_CLOCK_IR);

    /* Disable rx,set rx in software mode and enable rx input inverse */
    tmpVal = BL_RD_REG(IR_BASE, IRRX_CONFIG);
    tmpVal = BL_CLR_REG_BIT(tmpVal, IR_CR_IRRX_EN);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, IR_CR_IRRX_MODE, 0x2);
    tmpVal = BL_SET_REG_BIT(tmpVal, IR_CR_IRRX_IN_INV);
    BL_WR_REG(IR_BASE, IRRX_CONFIG, tmpVal);
    /* Set pulse width threshold to trigger end condition */
    tmpVal = BL_RD_REG(IR_BASE, IRRX_PW_CONFIG);
    BL_WR_REG(IR_BASE, IRRX_PW_CONFIG, BL_SET_REG_BITS_VAL(tmpVal, IR_CR_IRRX_END_TH, 19999));

    /* Clear and mask rx interrupt */
    tmpVal = BL_RD_REG(IR_BASE, IRRX_INT_STS);
    tmpVal = BL_SET_REG_BIT(tmpVal, IR_CR_IRRX_END_MASK);
    BL_WR_REG(IR_BASE, IRRX_INT_STS, BL_SET_REG_BIT(tmpVal, IR_CR_IRRX_END_CLR));

    /* Enable rx */
    tmpVal = BL_RD_REG(IR_BASE, IRRX_CONFIG);
    BL_WR_REG(IR_BASE, IRRX_CONFIG, BL_SET_REG_BIT(tmpVal, IR_CR_IRRX_EN));

    /* Wait for rx interrupt */
    while (SET != IR_GetIntStatus(IR_INT_RX_END)) {
        timeoutCnt--;

        if (timeoutCnt == 0) {
            IR_Disable(IR_RX);

            return IR_RX_SWM;
        }
    }

    /* Disable rx */
    tmpVal = BL_RD_REG(IR_BASE, IRRX_CONFIG);
    BL_WR_REG(IR_BASE, IRRX_CONFIG, BL_CLR_REG_BIT(tmpVal, IR_CR_IRRX_EN));

    /* Clear rx interrupt */
    tmpVal = BL_RD_REG(IR_BASE, IRRX_INT_STS);
    BL_WR_REG(IR_BASE, IRRX_INT_STS, BL_SET_REG_BIT(tmpVal, IR_CR_IRRX_END_CLR));

    /*Receive data */
    *length = IR_GetRxFifoCount();
    *length = IR_SWMReceiveData((uint16_t *)data, *length);

    /* Judge protocol type */
    if (NEC_HEAD_H_MIN < (data[0] & 0xffff) && (data[0] & 0xffff) < NEC_HEAD_H_MAX && NEC_HEAD_L_MIN < (data[0] >> 16) && (data[0] >> 16) < NEC_HEAD_L_MAX && NEC_BIT0_H_MIN < (data[1] & 0xffff) && (data[1] & 0xffff) < NEC_BIT0_H_MAX) {
        /* Set rx in NEC mode */
        tmpVal = BL_RD_REG(IR_BASE, IRRX_CONFIG);
        BL_WR_REG(IR_BASE, IRRX_CONFIG, BL_SET_REG_BITS_VAL(tmpVal, IR_CR_IRRX_MODE, 0x0));
        /* Set pulse width threshold to trigger end condition and pulse width threshold for logic0/1 detection */
        BL_WR_REG(IR_BASE, IRRX_PW_CONFIG, 0x23270d47);
        /* Set tx in NEC mode */
        /* Tx configure */
        BL_WR_REG(IR_BASE, IRTX_CONFIG, 0x1fc514);
        /* Set logic 0,logic 1,head and tail pulse width */
        BL_WR_REG(IR_BASE, IRTX_PW_0, 0x02000000);
        BL_WR_REG(IR_BASE, IRTX_PW_1, 0x0000070f);
        /* Set modulation phase width and pulse width unit */
        BL_WR_REG(IR_BASE, IRTX_PULSE_WIDTH, 0x22110464);

